apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c123_sysctrl.h
/********************************************************************************************
 * arch/arm/src/tiva/hardware/tm4c/tm4c123_sysctrl.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ********************************************************************************************/

#ifndef __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C123_SYSCONTROL_H
#define __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C123_SYSCONTROL_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>

/********************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************/

/* System Control Register Offsets **********************************************************/

#define TIVA_SYSCON_DID0_OFFSET       0x0000 /* Device Identification 0 */
#define TIVA_SYSCON_DID1_OFFSET       0x0004 /* Device Identification 1 */
#define TIVA_SYSCON_PBORCTL_OFFSET    0x0030 /* Brown-Out Reset Control */
#define TIVA_SYSCON_RIS_OFFSET        0x0050 /* Raw Interrupt Status */
#define TIVA_SYSCON_IMC_OFFSET        0x0054 /* Interrupt Mask Control */
#define TIVA_SYSCON_MISC_OFFSET       0x0058 /* Masked Interrupt Status and Clear */
#define TIVA_SYSCON_RESC_OFFSET       0x005c /* Reset Cause */
#define TIVA_SYSCON_RCC_OFFSET        0x0060 /* Run-Mode Clock Configuration */
#define TIVA_SYSCON_GPIOHBCTL_OFFSET  0x006c /* GPIO High-Performance Bus Control */
#define TIVA_SYSCON_RCC2_OFFSET       0x0070 /* Run-Mode Clock Configuration 2 */
#define TIVA_SYSCON_MOSCCTL_OFFSET    0x007c /* Main Oscillator Control */
#define TIVA_SYSCON_DSLPCLKCFG_OFFSET 0x0144 /* Deep Sleep Clock Configuration */
#define TIVA_SYSCON_SYSPROP_OFFSET    0x014c /* System Properties */
#define TIVA_SYSCON_PIOSCCAL_OFFSET   0x0150 /* Precision Internal Oscillator Calibration */
#define TIVA_SYSCON_PIOSCSTAT_OFFSET  0x0154 /* Precision Internal Oscillator Statistics */
#define TIVA_SYSCON_PLLFREQ0_OFFSET   0x0160 /* PLL 0 Frequency */
#define TIVA_SYSCON_PLLFREQ1_OFFSET   0x0164 /* PLL 1 Frequency */
#define TIVA_SYSCON_PLLSTAT_OFFSET    0x0168 /* PLL Status */
#define TIVA_SYSCON_SLPPWRCFG_OFFSET  0x0188 /* Sleep Power Configuration */
#define TIVA_SYSCON_DSLPPWRCFG_OFFSET 0x018c /* Deep-Sleep Power Configuration */
#define TIVA_SYSCON_LDOSPCTL_OFFSET   0x01b4 /* LDO Sleep Power Control */
#define TIVA_SYSCON_LDOSPCAL_OFFSET   0x01b8 /* LDO Sleep Power Calibration */
#define TIVA_SYSCON_LDODPCTL_OFFSET   0x01bc /* LDO Deep-Sleep Power Control */
#define TIVA_SYSCON_LDODPCAL_OFFSET   0x01c0 /* LDO Deep-Sleep Power Calibration */
#define TIVA_SYSCON_SDPMST_OFFSET     0x01cc /* Sleep / Deep-Sleep Power Mode Status */

#define TIVA_SYSCON_PPWD_OFFSET       0x0300 /* Watchdog Timer Peripheral Present */
#define TIVA_SYSCON_PPTIMER_OFFSET    0x0304 /* 16/32-Bit Timer Peripheral Present */
#define TIVA_SYSCON_PPGPIO_OFFSET     0x0308 /* GPIO Peripheral Present */
#define TIVA_SYSCON_PPDMA_OFFSET      0x030c /* uDMA Peripheral Present */
#define TIVA_SYSCON_PPHIB_OFFSET      0x0314 /* Hibernation Peripheral Present */
#define TIVA_SYSCON_PPUART_OFFSET     0x0318 /* UART Present */
#define TIVA_SYSCON_PPSSI_OFFSET      0x031c /* SSI Peripheral Present */
#define TIVA_SYSCON_PPI2C_OFFSET      0x0320 /* I2C Peripheral Present */
#define TIVA_SYSCON_PPUSB_OFFSET      0x0328 /* USB Peripheral Present */
#define TIVA_SYSCON_PPCAN_OFFSET      0x0334 /* CAN Peripheral Present */
#define TIVA_SYSCON_PPADC_OFFSET      0x0338 /* ADC Peripheral Present */
#define TIVA_SYSCON_PPACMP_OFFSET     0x033c /* Analog Comparator Peripheral Present */
#define TIVA_SYSCON_PPPWM_OFFSET      0x0340 /* Pulse Width Modulator Peripheral Present */
#define TIVA_SYSCON_PPQEI_OFFSET      0x0344 /* Quadrature Encoder Peripheral Present */
#define TIVA_SYSCON_PPEEPROM_OFFSET   0x0358 /* EEPROM Peripheral Present */
#define TIVA_SYSCON_PPWTIMER_OFFSET   0x035c /* 32/64-Bit Wide Timer Peripheral Present */

#define TIVA_SYSCON_SR_OFFSET         0x0500
#define TIVA_SYSCON_SRWD_OFFSET       0x0500 /* Watchdog Timer Software Reset */
#define TIVA_SYSCON_SRTIMER_OFFSET    0x0504 /* 16/32-Bit Timer Software Reset */
#define TIVA_SYSCON_SRGPIO_OFFSET     0x0508 /* GPIO Software Reset */
#define TIVA_SYSCON_SRDMA_OFFSET      0x050c /* uDMA Software Reset */
#define TIVA_SYSCON_SRHIB_OFFSET      0x0514 /* Hibernation Software Reset */
#define TIVA_SYSCON_SRUART_OFFSET     0x0518 /* UART Software Reset*/
#define TIVA_SYSCON_SRSSI_OFFSET      0x051c /* SSI Software Reset */
#define TIVA_SYSCON_SRI2C_OFFSET      0x0520 /* I2C Software Reset */
#define TIVA_SYSCON_SRUSB_OFFSET      0x0528 /* USB Software Reset */
#define TIVA_SYSCON_SRCAN_OFFSET      0x0534 /* CAN Software Reset */
#define TIVA_SYSCON_SRADC_OFFSET      0x0538 /* ADC Software Reset */
#define TIVA_SYSCON_SRACMP_OFFSET     0x053c /* Analog Comparator Software Reset */
#define TIVA_SYSCON_SRPWM_OFFSET      0x0540 /* Pulse Width Modulator Software Reset */
#define TIVA_SYSCON_SRQEI_OFFSET      0x0544 /* Quadrature Encoder Interface Software Reset */
#define TIVA_SYSCON_SREEPROM_OFFSET   0x0558 /* EEPROM Software Reset */
#define TIVA_SYSCON_SRWTIMER_OFFSET   0x055c /* 32/64-Bit Wide Timer Software Reset */

#define TIVA_SYSCON_RCGC_OFFSET       0x0600
#define TIVA_SYSCON_RCGCWD_OFFSET     0x0600 /* Watchdog Timer Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCTIMER_OFFSET  0x0604 /* 16/32-Bit Timer Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCGPIO_OFFSET   0x0608 /* GPIO Run Mode Clock Gating Control*/
#define TIVA_SYSCON_RCGCDMA_OFFSET    0x060c /* uDMA Run Mode Clock Gating Control*/
#define TIVA_SYSCON_RCGCHIB_OFFSET    0x0614 /* Hibernation Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCUART_OFFSET   0x0618 /* UART Run Mode Clock Gating Control*/
#define TIVA_SYSCON_RCGCSSI_OFFSET    0x061c /* SSI Run Mode Clock Gating Control*/
#define TIVA_SYSCON_RCGCI2C_OFFSET    0x0620 /* I2C Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCUSB_OFFSET    0x0628 /* USB Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCCAN_OFFSET    0x0634 /* CAN Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCADC_OFFSET    0x0638 /* ADC Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCACMP_OFFSET   0x063c /* Analog Comparator Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCPWM_OFFSET    0x0640 /* Pulse Width Modulator Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCQEI_OFFSET    0x0644 /* Quadrature Encoder Interface Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCEEPROM_OFFSET 0x0658 /* EEPROM Run Mode Clock Gating Control */
#define TIVA_SYSCON_RCGCWTIMER_OFFSET 0x065c /* 32/64-BitWide Timer Run Mode Clock Gating Control */

